/*
试题 E: 迷宫

本题总分： 15 分
【问题描述】

下图给出了一个迷宫的平面图，其中标记为 1 的为障碍，标记为 0 的为可
以通行的地方。
010000
000100
001001
110000
迷宫的入口为左上角，出口为右下角，在迷宫中，只能从一个位置走到这
个它的上、下、左、右四个方向之一。
对于上面的迷宫，从入口开始，可以按DRRURRDDDR 的顺序通过迷宫，
一共 10 步。其中 D、 U、 L、 R 分别表示向下、向上、向左、向右走。
对于下面这个更复杂的迷宫（30 行 50 列），请找出一种通过迷宫的方式，
其使用的步数最少，在步数最少的前提下，请找出字典序最小的一个作为答案。
请注意在字典序中D<L<R<U。（如果你把以下文字复制到文本文件中，请务
必检查复制的内容是否与文档中的一致。在试题目录下有一个文件 maze.txt，
内容与下面的文本相同）
01010101001011001001010110010110100100001000101010
00001000100000101010010000100000001001100110100101
01111011010010001000001101001011100011000000010000
01000000001010100011010000101000001010101011001011
00011111000000101000010010100010100000101100000000
11001000110101000010101100011010011010101011110111
00011011010101001001001010000001000101001110000000
10100000101000100110101010111110011000010000111010
00111000001010100001100010000001000101001100001001
11000110100001110010001001010101010101010001101000
00010000100100000101001010101110100010101010000101
11100100101001001000010000010101010100100100010100
00000010000000101011001111010001100000101010100011
10101010011100001000011000010110011110110100001000
10101010100001101010100101000010100000111011101001
10000000101100010000101100101101001011100000000100
10101001000000010100100001000100000100011110101001
00101001010101101001010100011010101101110000110101
11001010000100001100000010100101000001000111000010
00001000110000110101101000000100101001001000011101
10100101000101000000001110110010110101101010100001
00101000010000110101010000100010001001000100010101
10100001000110010001000010101001010101011111010010
00000100101000000110010100101001000001000000000010
11010000001001110111001001000011101001011011101000
00000110100010001000100000001000011101000000110011
10101000101000100010001111100010101001010000001000
10000010100101001010110000000100101010001011101000
00111100001000010000000110111000000001000000001011
10000001100111010111010001000110111010101101111000
【答案提交】
这是一道结果填空的题，你只需要算出结果后提交即可。本题的结果为一
个字符串，包含四种字母 D、 U、 L、 R，在提交答案时只填写这个字符串，填
写多余的内容将无法得分。
*/
#include <iostream>
#include <cstring>
#include <queue>

using namespace std;

struct node {
	int x;
	int y;
}_start, _end;     //_start为起点坐标，_end为终点坐标

int step;
char ans[1000] = { 0 };
const char dir[] = { 'D', 'L', 'R', 'U' };   //字典顺序
const int dx[] = { 1, 0, 0, -1 };    //方向向量
const int dy[] = { 0, -1, 1, 0 };
const int maxn = 100;
int maze[maxn][maxn];
int vis[maxn][maxn];
queue<node> que;       //node类型队列
int row, col;

bool check(int x, int y) {
	if (x<0 || x>row - 1 || y<0 || y>col - 1 || maze[x][y] == 1 || vis[x][y] != 0) {
		return false;        //if语句内：保证x，y处于迷宫内且不穿墙，未走过
	}
	return true;
}

void bfs() {
	que.push(_start);      //将起点坐标入队
	while (!que.empty()) {
		node far;      //定义父节点
		far = que.front();    //出队一个元素作为父节点
		que.pop();
		if (far.x == _end.x && far.y == _end.y) {
			break;     //到达终点退出循环
		}
		for (int i = 0; i < 4; i++) {
			node next;         //定义下一坐标node类型next
			next.x = far.x + dx[i];       //向四个方向试探
			next.y = far.y + dy[i];
			if (check(next.x, next.y)) {
				que.push(next);      //若检查通过则将此节点入队，再出队时就是作为父节点了
				vis[next.x][next.y] = vis[far.x][far.y] + 1;
			}        //vis数组除了标记已走过，也记录了步数	
		}
	}
}

//通过深搜将路径倒序表示出来，此题用了字母表示
void dfs(int x, int y, int step) {
	if (x == _start.x && y == _start.y) {   //到达了起点
		return;
	}
	for (int i = 0; i < 4; i++) {    //向四个方向试探
		int nx = x + dx[i];
		int ny = y + dy[i];
		if (vis[nx][ny] == vis[x][y] - 1) {   //若下一个方向的vis数组数字比当前小1
			ans[step] = dir[3 - i];       //记录答案（因为是从终点返回，因此若要保证字典序最小，需要倒着表示）
			dfs(nx, ny, step + 1);
			break;   //找到了符合的方向就无需再寻找其他方向了，直接break
		}
	}
}

void output() {
	for (int i = 0; i < row; i++) {
		for (int j = 0; j < col; j++) {
			printf("%-3d", vis[i][j]);
		}
		cout << endl;
	}
}

int main() {
	cin >> row >> col;
	for (int i = 0; i < row; i++) {
		for (int j = 0; j < col; j++) {
			cin >> maze[i][j];
		}
	}
	_start.x = _start.y = 0;
	_end.x = row - 1;
	_end.y = col - 1;
	vis[0][0] = 1;     //此处必须将起点设为1，否则check函数检查时发现vis[0][0]为0会向起点走
	bfs();
	output();
	dfs(_end.x, _end.y, 0);
	_strrev(ans);    //将答案数组逆序，逆序后即为起点到终点的路径
	cout << ans << endl;
	return 0;
}